---
kind: method
id: M:Autodesk.Revit.DB.TriangulatedShellComponent.Clear
source: html/52d0d704-a437-aaea-c495-734e2c7ffa8f.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.Clear Method

Empties the contents of this TriangulatedShellComponent.

## Syntax (C#)
```csharp
public void Clear()
```